of/Mauritius/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
334330
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 -0 0);
    }
    deck
    {
        type            calculated;
        value           nonuniform List<vector> 
1090
(
(0 -3.92722e-25 15909.7)
(0 -0 15899)
(0 -3.91135e-25 15888.3)
(0 -3.90345e-25 15877.6)
(0 -0 15866.9)
(0 -3.88771e-25 15856.2)
(0 -3.87987e-25 15845.5)
(0 5.14194e-18 15834.9)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
